2.3.x/channel/0.org/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity            (20 0 0);
pressure                1e5;
turbulentKE             6.0;    // 10% turbulence
turbulentEpsilon        985.6;  // based on 0.07*Dinlet

particleConcentration   0.00015;

temperature             295;

#inputMode              merge

// ************************************************************************* //
