2.3.x/channel/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions          [ 1 -1 -2 0 0 0 0 ];

internalField       uniform $pressure;

boundaryField
{
    inlet
    {
        type               fixedFluxPressure;
        value              $internalField;
    }

    outlet
    {
        type               fixedValue;
        value              $internalField;
    }

    top
    {
        type               fixedFluxPressure;
        value              $internalField;
    }

    bottom
    {
        type               fixedFluxPressure;
        value              $internalField;
    }

    frontAndBack
    {
        type               empty;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
