2.3.x/channel/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

cp -r 0.org 0
cp 0/alpha.air.org 0/alpha.air
cp 0/alpha.particles.org 0/alpha.particles

runApplication blockMesh

#runApplication solver8FastLoop


# ----------------------------------------------------------------- end-of-file
