2.3.x/channel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     twoPhaseEulerFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          5e-5;

writeControl    runTime;

writeInterval   0.05;//0.1;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable on;

adjustTimeStep  no;

maxCo           0.9;

maxDeltaT       1e-05;

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        outputControl   outputTime;
        fields
        (
            U.particles
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            U.water
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            alpha.particles
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }

            p
            {
                 mean        on;
                 prime2Mean  off;
                 base        time;
            }
        );
    }

    probes
    {
        type            probes;
        functionObjectLibs ( "libsampling.so" );

        name            probes;

        probeLocations
        (
            (5.8 0.0175 0)
            (5.8 0.0175 0.0035)
            (5.8 0.0175 0.007)
            (5.8 0.0175 0.0105)
            (5.8 0.0175 0.014)
            (5.8 0.0175 0.0175)
            (5.8 0.0175 0.021)
            (5.8 0.0175 0.0245)
            (5.8 0.0175 0.028)
            (5.8 0.0175 0.0315)
            (5.8 0.0175 0.035)
        );

        fields          (U1);
        outputControl   timeStep;
        outputInterval  1;
     }
}


// ************************************************************************* //
